In [1]:
import pandas as pd

In [2]:
account_info = pd.DataFrame({
    'name': ["Bob", 'Mary', 'Mita'],
    'account': [123846, 123972, 347209],
    'balance': [123, 3972, 7209]
})

In [3]:
account_info.iloc[account_info.index % 2 == 0]

   name  account  balance
0   Bob   123846      123
2  Mita   347209     7209

In [4]:
account_info.iloc[account_info.index % 2 == 1]

   name  account  balance
1  Mary   123972     3972